Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.CreateInputDefinition Method (Tuple<Point, ViewBase>)
 Creates a single-point input definition.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DrawingPluginBase.InputDefinition CreateInputDefinition(
	Tuple<Point, ViewBase> input
)
Public Shared Function CreateInputDefinition (
	input As Tuple(Of Point, ViewBase)
) As DrawingPluginBase.InputDefinition
Parameters
input
Type: System.Tuple<Point, ViewBase>
The point and the view to be used in the input.
Return Value
Type: DrawingPluginBase.InputDefinition
The input definition.
See Also
Reference
InputDefinitionFactory Class
CreateInputDefinition Overload
Tekla.Structures.Drawing.Tools Namespace